from src.services import simple_search

def test_simple_search(test_main_list, test_pattern):
    assert simple_search(test_main_list, test_pattern) == ('[\n'
 '    {\n'
 '        "Дата операции": "30.08.2021 20:35:38",\n'
 '        "Дата платежа": "30.08.2021",\n'
 '        "Номер карты": "*7197",\n'
 '        "Статус": "OK",\n'
 '        "Сумма операции": -15.0,\n'
 '        "Валюта операции": "USD",\n'
 '        "Сумма платежа": -1129.5,\n'
 '        "Валюта платежа": "RUB",\n'
 '        "Кэшбэк": null,\n'
 '        "Категория": "НКО",\n'
 '        "MCC": 8398.0,\n'
 '        "Описание": "Association For Computing",\n'
 '        "Бонусы (включая кэшбэк)": 22,\n'
 '        "Округление на инвесткопилку": 0,\n'
 '        "Сумма операции с округлением": 1129.5\n'
 '    }\n'
 ']')